Tekla.Structures.Drawing.PluginPickerInputSerializer
Class dedicated to serialize and transport a PluginPickerInput from .NET to core

Tekla.Structures.Drawing.PluginPickerInputSerializer._ListOfTypes
List of Inputs.Count PickerInputTypes_e that contains the type of each PickerInput in Inputs

Tekla.Structures.Drawing.PluginPickerInputSerializer._ListOfViewIdentifiers
List of Inputs.Count Identifiers that contains the PickedView identifier of each contained PickerInput

Tekla.Structures.Drawing.PluginPickerInputSerializer._ListOfSizesOfPointLists
List of Inputs.Count integers that describes how many points each contained PickerInput contains

Tekla.Structures.Drawing.PluginPickerInputSerializer._ListOfPoints
Variable size list that concatenates all the points used in all PickerInputs of this PluginPickerInput which pick some points

Tekla.Structures.Drawing.PluginPickerInputSerializer._ListOfObjectIdentifiers
Variable size list that concatenates all the objects used in all PickerInputs of this PluginPickerInput which pick an object

Tekla.Structures.Drawing.PluginPickerInputSerializer.#ctor(Tekla.Structures.Drawing.PluginPickerInput)
Creates a new instance of class PluginPickedInputSerializer which is a serialized representation of a PluginInput
PluginInput: PluginPickerInput instance to serialize in this PluginPickerInputSerializer

Tekla.Structures.Drawing.PluginPickerInputSerializer.Export
Export serialized instance from .NET to core
Returns:

Tekla.Structures.Drawing.PluginPickerInputSerializer.GetListOfTypes(Tekla.Structures.Drawing.PluginPickerInput)
List of PluginInput.Inputs.Count PickerInputTypes_e that contains the type of each PickerInput in Inputs

Tekla.Structures.Drawing.PluginPickerInputSerializer.GetListOfViewIdentifiers(Tekla.Structures.Drawing.PluginPickerInput)
List of PluginInput.Inputs.Count Identifiers that contains the PickedView identifier of each contained PickerInput

Tekla.Structures.Drawing.PluginPickerInputSerializer.GetListOfSizesOfPointLists(Tekla.Structures.Drawing.PluginPickerInput)
List of PluginInput.Inputs.Count integers that describes how many points each contained PickerInput contains

Tekla.Structures.Drawing.PluginPickerInputSerializer.GetListOfPoints(Tekla.Structures.Drawing.PluginPickerInput)
Variable size list that concatenates all the points used in all PickerInputs of this PluginPickerInput which pick some points

Tekla.Structures.Drawing.PluginPickerInputSerializer.GetListOfObjectIdentifiers(Tekla.Structures.Drawing.PluginPickerInput)
Variable size list that concatenates all the objects used in all PickerInputs of this PluginPickerInput which pick an object